#Automatically act on Defender for Endpoint alerts related to credential dumping
SecurityAlert
| where ProviderName == "MDATP"
| where AlertName contains "Credential Theft" or AlertName contains "Mimikatz"
